/*
企业发放的奖金根据利润提成。利润I低于或等于100000元的,奖金可提成.
10%;利润高于100000元，低于200000元(100000<I≤200000)时，低于100000元的部.
分按10%提成,高于100 000元的部分，可提成7. 5%;200 000< I≤400000时，低于
200 000元的部分仍按上述办法提成(下同)。高于200 000元的部分按5%提成;400000<
I≤600 000元时,高于400 000元的部分按3%提成;600 000<1≤1 000 000时,高于
600 000元的部分按1.5%提成;I>1 000 000时,超过1 000 000元的部分按1%提成。从
键盘输人当月利润I,求应发奖金总数。
要求:
(1)用if语句编程序;
(2)用switch语句编程序。
*/

#include<stdio.h>
int main(){
    /*double I,b;
    printf("请输入当月利润：");
    scanf("%lf",&I);         //输入当月利润
    b = 0;
    if (I <= 100000) {
        b = I * 0.1;
    }
    else if (I <= 200000) {
        b = 100000 * 0.1 + (I - 100000) * 0.075;
    }
    else if (I <= 400000) {
        b = 100000 * 0.1 + 100000 * 0.075 + (I - 200000) * 0.05;
    }
    else if (I <= 600000) {
        b = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (I - 400000) * 0.03;
    }
    else if (I <= 1000000) {
        b = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (I - 600000) * 0.015;
    }
    else {
        b = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (I - 1000000) * 0.01;
    }
    printf("应发奖金总数为：%.2f元\n",b);      //输出应发奖金总数
    return 0;
    */
   double i,b;
   int c;
    printf("请输入当月利润：");
    scanf("%lf",&i);         //输入当月利润  
    if (i>1000000)
    {
        c=10;
    }
    else{
        c=i/100000;
    }
    switch (c)
    {
    case 0:
        b = i * 0.1;
        break;
    case 1:
        b = 100000 * 0.1 + (i - 100000) * 0.075;
        break;
    case 2:    case 3:
        b = 100000 * 0.1 + 100000 * 0.075 + (i - 200000) * 0.05;
        break;
    case 4:    case 5:
        b = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (i - 400000) * 0.03;
        break;
    case 6:    case 7:    case 8:    case 9:
        b = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (i - 600000) * 0.15;
        break;
    case 10:
        b = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.15 + (i - 1e6) * 1e-2;
        break;
    default:
        printf("输入错误\n");
        break;  
    }
    printf("应发奖金总数为：%.2f元\n",b);      //输出应发奖金总数
    return 0;
}